[
  {
    "title": "Comprehensive GYM Management System",
    "github": "https://github.com/tngonzalez/Noahs-GYM",
    "description": "It's a management system designed and developed in C# to provide an optimal experience in tracking routines, weight progress and user management in a modern gym environment. This intuitive and efficient system allows users, trainers and administrators to optimize their time and maximize training results.",
    "technologies": [
      "C#",
      "SQL Server",
      "Log4Net",
      "QR Code"
    ],
    "images": [
      "images/gym1.png",
      "images/gym2.png",
      "images/gym3.png",
      "images/gym4.png",
      "images/gym5.png",
      "images/gym6.png",
      "images/gym7.png"
    ]
  },
  {
    "title": "System for File Management and Medical Appointment Booking",
    "github": "https://github.com/tngonzalez/Clinica-Mia",
    "description": "This web application was designed to manage both medical and personal records, enabling users to efficiently schedule medical appointments and manage the different areas of the clinic. The system provides an intuitive interface for both patients and medical staff, enhancing operational efficiency and improving the overall user experience.",
    "technologies": ["PHP", "ReactJS", "MySQL"],
    "images": [
      "images/cm1.png",
      "images/cm2.png",
      "images/cm3.png",
      "images/cm5.png",
      "images/cm6.png"
    ]
  },
  {
    "title": "Integral System for Managing the FTTH Service",
    "github": "https://github.com/tngonzalez/NETSYS",
    "description": "This project was designed to optimize and effectively manage various areas of the FTTH service. The key components of this solution include routers, sticks DSN, OLTs, ports, public IPs and genereted descriptive reports that offer a clear vision and detailed status and  performance insights for each element.",
    "technologies": ["Prisma", "NodeJS", "Angular", "Tailwind", "MySQL"],
    "images": [
      "images/sc1.png",
      "images/sc2.png",
      "images/sc3.png",
      "images/sc4.png",
      "images/sc5.png",
      "images/sc6.png",
      "images/sc7.png"
    ]
  },
  {
    "title": "System for Managing Events and Reports",
    "github": "https://github.com/LSElias/ASOMET",
    "description": "This project consisted of a system designed to manage events, user information and their reports. The main objective of this system was to provide detailed information about the event confirmations and absences. It also allowed for the analysis of participation rates through specific and graphical reports. In this project, I took on the role of the backend leader which involved designing and implementing the business logic, including advance queries for personalized reports. Addicionally, I coordinated and managed team goals to ensure the proper execution of each module within the established timelines.",
    "technologies": ["Prisma", "NodeJS", "Angular", "Tailwind", "MySQL"],
    "images": [
      "images/aso1.png",
      "images/aso12.png",
      "images/aso13.png",
      "images/aso14.png",
      "images/aso2.png",
      "images/aso3.png"
  ]
  },
  {
    "title": "Eco-Currency Management System",
    "github": "https://github.com/LSElias/GreenWallet",
    "description": "",
    "technologies": ["TypeScript", "Prisma", "NodeJS", "Material UI", "MySQL"],
    "images": [
      "images/gw1.png",
      "images/gw2.png",
      "images/gw3.png",
      "images/gw4.png",
      "images/gw5.png",
      "images/gw6.png"
    ]
  }
]
